package synchronization.locks.entities;

import lombok.Getter;
import synchronization.locks.utils.Logger;

import java.util.Random;

@Getter
public class Person implements Runnable, Comparable<Person> {
    private String firstName;
    private String lastName;
    private byte age;
    private Sex sex;
    private boolean isAlive;

    private double income;

    private Logger log = Logger.getInstance();

    private static final String[] MALE_NAMES = {"Абрам", "Аваз", "Августин", "Авраам", "Агап", "Агапит",
            "Агафон", "Адам", "Адриан", "Азамат", "Азат", "Айдар", "Айрат", "Акакий", "Аким", "Алан",
            "Александр", "Алексей", "Али", "Алик", "Алихан", "Алмаз", "Альберт", "Амир", "Амирам",
            "Анар", "Анастасий", "Анатолий", "Ангел", "Андрей", "Анзор", "Антон", "Анфим", "Арам",
            "Аристарх", "Аркадий", "Арман", "Армен", "Арсен", "Арсений", "Арслан", "Артемий", "Артур",
            "Артём", "Архип", "Аскар", "Асхан", "Ахмет", "Ашот", "Бахрам", "Блез", "Богдан", "Борис",
            "Борислав", "Бронислав", "Булат", "Вадим", "Валентин", "Валерий", "Вальдемар", "Вардан",
            "Василий", "Вениамин", "Виктор", "Вильгельм", "Вит", "Виталий", "Владимир", "Владислав",
            "Владлен", "Влас", "Всеволод", "Вячеслав", "Гавриил", "Гамлет", "Гарри", "Геннадий", "Генри",
            "Генрих", "Георгий", "Герасим", "Герман", "Германн", "Глеб", "Гордей", "Григорий", "Густав",
            "Давид", "Давлат", "Дамир", "Дана", "Даниил", "Данислав", "Данияр", "Дарий", "Даурен",
            "Демид", "Демьян", "Денис", "Джамал", "Джеймс", "Джереми", "Джером", "Джозеф", "Джонатан",
            "Дик", "Динар", "Дино", "Дмитрий", "Добрыня", "Доминик", "Евгений", "Евдоким", "Евсей",
            "Евстахий", "Егор", "Елисей", "Емельян", "Еремей", "Ефим", "Ефрем", "Ждан", "Жерар", "Жигер",
            "Закир", "Заур", "Захар", "Зенон", "Зигмунд", "Зиновий", "Зураб", "Зуфар", "Ибрагим", "Иван",
            "Игнат", "Игнатий", "Игорь", "Иеремия", "Иероним", "Иисус", "Ильгиз", "Ильнур", "Ильшат",
            "Илья", "Имран", "Иннокентий", "Иосиф", "Ираклий", "Исаак", "Исаакий", "Исидор", "Искандер",
            "Ислам", "Исмаил", "Итан", "Казбек", "Камиль", "Карен", "Карим", "Карл", "Ким", "Кир",
            "Кирилл", "Клаус", "Клим", "Конрад", "Константин", "Корнелий", "Кристиан", "Кузьма",
            "Лаврентий", "Лев", "Ленар", "Леон", "Леонард", "Леонид", "Леопольд", "Лоренс", "Лука",
            "Лукиллиан", "Лукьян", "Любомир", "Людвиг", "Людовик", "Люций", "Маджид", "Майкл", "Макар",
            "Макарий", "Максим", "Максимилиан", "Максуд", "Мансур", "Мар", "Марат", "Марк", "Марсель",
            "Мартин", "Мартын", "Матвей", "Махмуд", "Мика", "Микула", "Милослав", "Мирон", "Мирослав",
            "Михаил", "Моисей", "Мстислав", "Мурат", "Муслим", "Мухаммед", "Мэтью", "Назар", "Наиль",
            "Нестор", "Никита", "Никодим", "Никола", "Николай", "Нильс", "Огюст", "Олег", "Оливер",
            "Орест", "Орландо", "Осип", "Оскар", "Остап", "Остин", "Павел", "Панкрат", "Патрик", "Педро",
            "Перри", "Платон", "Потап", "Прохор", "Пётр", "Равиль", "Радий", "Радик", "Радомир",
            "Радослав", "Разиль", "Райан", "Раймонд", "Рамазан", "Рамиз", "Рамиль", "Рамон", "Ранель",
            "Расим", "Расул", "Ратмир", "Рафаэль", "Рафик", "Рашид", "Ренат", "Ринат", "Ричард",
            "Роберт", "Родион", "Ролан", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан", "Рустам",
            "Рэй", "Савва", "Савелий", "Саид", "Самат", "Самвел", "Самир", "Самуил", "Санжар", "Сани",
            "Святослав", "Севастьян", "Семён", "Серафим", "Сергей", "Сесил", "Сидор", "Спартак",
            "Станислав", "Степан", "Султан", "Тагир", "Тайлер", "Тамаз", "Тамерлан", "Тарас", "Тигран",
            "Тимофей", "Тимур", "Тихон", "Томас", "Трофим", "Уинслоу", "Умар", "Устин", "Фазиль",
            "Фарид", "Федот", "Феликс", "Филипп", "Флор", "Фома", "Фред", "Фридрих", "Фёдор", "Хабиб",
            "Хаким", "Харитон", "Хасан", "Цезарь", "Цефас", "Цецилий", "Цицерон", "Чарльз", "Чеслав",
            "Чингиз", "Шамиль", "Шарль", "Шерлок", "Эдгар", "Эдуард", "Эльдар", "Эмиль", "Эмин", "Эрик",
            "Эркюль", "Эрмин", "Эузебио", "Юлиан", "Юлий", "Юнус", "Юрий", "Юстиниан", "Юстус", "Яков",
            "Ян", "Яромир", "Ярослав"};
    private static final String[] FEMALE_NAMES = {"Августа", "Августина", "Авдотья", "Аврора", "Агапия",
            "Агата", "Агафья", "Аглая", "Агния", "Агунда", "Ада", "Аделаида", "Аделина", "Адель",
            "Адиля", "Адриана", "Аза", "Азалия", "Азиза", "Аида", "Аиша", "Айгерим", "Айгуль", "Айлин",
            "Айнагуль", "Айнур", "Айсель", "Айсун", "Айсылу", "Аксинья", "Алана", "Алевтина",
            "Александра", "Алеста", "Алина", "Алиса", "Алия", "Алла", "Алсу", "Альба", "Альбина",
            "Альфия", "Аля", "Алёна", "Амалия", "Амина", "Амира", "Анаит", "Анастасия", "Ангелина",
            "Анжела", "Анжелика", "Анисья", "Анна", "Антонина", "Анфиса", "Аполлинария", "Арабелла",
            "Ариана", "Арина", "Асель", "Асия", "Астрид", "Ася", "Аэлита", "Бажена", "Беатрис", "Бела",
            "Белинда", "Белла", "Берта", "Богдана", "Божена", "Бэлла", "Валентина", "Валерия", "Ванда",
            "Ванесса", "Варвара", "Василина", "Василиса", "Венера", "Вера", "Вероника", "Веста", "Вета",
            "Викторина", "Виктория", "Вилена", "Виола", "Виолетта", "Вита", "Виталина", "Виталия",
            "Влада", "Владана", "Владислава", "Габриэлла", "Галина", "Галия", "Генриетта", "Гоар",
            "Грета", "Гульзира", "Гульмира", "Гульназ", "Гульнара", "Гульшат", "Гюзель", "Далида",
            "Дамира", "Дана", "Даниэла", "Дания", "Дара", "Дарина", "Дарья", "Даяна", "Джамиля",
            "Дженна", "Дженнифер", "Джессика", "Джиневра", "Диана", "Дильназ", "Дильнара", "Диля",
            "Дилярам", "Дина", "Динара", "Долорес", "Доминика", "Домна", "Домника", "Ева", "Евангелина",
            "Евгения", "Евдокия", "Екатерина", "Елена", "Елизавета", "Есения", "Жаклин", "Жанна",
            "Жансая", "Жасмин", "Жозефина", "Жоржина", "Забава", "Заира", "Залина", "Замира", "Зара",
            "Зарема", "Зарина", "Земфира", "Зинаида", "Зита", "Злата", "Златослава", "Зоряна", "Зоя",
            "Зульфия", "Зухра", "Ивета", "Иветта", "Изабелла", "Иллирика", "Илона", "Ильзира", "Илюза",
            "Инга", "Индира", "Инесса", "Инна", "Иоанна", "Ира", "Ирада", "Ираида", "Ирина", "Ирма",
            "Искра", "Ия", "Камила", "Камилла", "Кара", "Карина", "Каролина", "Кира", "Клавдия",
            "Клара", "Кора", "Корнелия", "Кристина", "Ксения", "Лада", "Лана", "Лара", "Лариса",
            "Лаура", "Лейла", "Леона", "Лера", "Леся", "Лиана", "Лидия", "Лика", "Лили", "Лилиана",
            "Лилия", "Лина", "Линда", "Лиора", "Лира", "Лия", "Лола", "Лолита", "Лора", "Луиза",
            "Лукерья", "Лукия", "Любава", "Любовь", "Людмила", "Люсиль", "Люсьена", "Люция", "Люче",
            "Ляйсан", "Ляля", "Мавиле", "Мавлюда", "Магда", "Магдалeна", "Мадина", "Мадлен", "Майя",
            "Макария", "Малика", "Мара", "Маргарита", "Марианна", "Марика", "Марина", "Мария", "Мариям",
            "Марта", "Марфа", "Мелания", "Мелисса", "Мика", "Мила", "Милада", "Милана", "Милен",
            "Милена", "Милица", "Милослава", "Мира", "Мирослава", "Мирра", "Мия", "Моника", "Муза",
            "Надежда", "Наиля", "Наима", "Нана", "Наоми", "Наргиза", "Наталья", "Нелли", "Нея", "Ника",
            "Николь", "Нина", "Нинель", "Номина", "Нора", "Нурия", "Одетта", "Оксана", "Октябрина",
            "Олеся", "Оливия", "Ольга", "Офелия", "Павлина", "Патриция", "Паула", "Пейтон", "Пелагея",
            "Перизат", "Платонида", "Полина", "Прасковья", "Рада", "Разина", "Раиса", "Рамина", "Регина",
            "Резеда", "Рена", "Рената", "Риана", "Рианна", "Рикарда", "Римма", "Рина", "Рита", "Рогнеда",
            "Роза", "Рузалия", "Рузанна", "Русалина", "Руслана", "Руфина", "Руфь", "Сабина", "Сабрина",
            "Сажида", "Саида", "Самира", "Сандра", "Сания", "Сара", "Сати", "Сафия", "Сафура",
            "Светлана", "Севара", "Серафима", "Сесилия", "Сиара", "Сильвия", "Снежана", "Соня", "Софья",
            "Стелла", "Стефания", "Сусанна", "Таисия", "Тамара", "Тамила", "Тара", "Татьяна", "Таяна",
            "Теона", "Тереза", "Тина", "Томирис", "Тора", "Ульяна", "Урсула", "Устинья", "Фазиля",
            "Фаина", "Фарида", "Фариза", "Фатима", "Феруза", "Фируза", "Флора", "Флоренс", "Флорентина",
            "Флоренция", "Флориана", "Фредерика", "Фрида", "Фёкла", "Хадия", "Хилари", "Хлоя", "Цагана",
            "Цветана", "Цецилия", "Циара", "Челси", "Чеслава", "Чулпан", "Шакира", "Шарлотта", "Шахина",
            "Шейла", "Шелли", "Шерил", "Эвелина", "Эвита", "Элеонора", "Элиана", "Элиза", "Элина",
            "Элла", "Эльвина", "Эльвира", "Эльмира", "Эльнара", "Эля", "Эмили", "Эмилия", "Эмма", "Энже",
            "Эрика", "Эрмина", "Эсмеральда", "Эсмира", "Этель", "Этери", "Юлианна", "Юлия", "Юна",
            "Юния", "Юнона", "Ядвига", "Яна", "Янина", "Ярина", "Ярослава", "Ясмина"};

    private static long LATENCY = 100;

    static void setLATENCY(long latency) {
        LATENCY = latency;
    }

    public static Person generatePerson(String surname, boolean isAdult, Boolean isFemale) {
        Random rnd = new Random();
        Sex sex = isFemale == null ?
                (rnd.nextBoolean() ? Sex.FEMALE : Sex.MALE)
                : isFemale ? Sex.FEMALE : Sex.MALE;
        String name;
        if (sex == Sex.FEMALE) {
            name = FEMALE_NAMES[(int) (Math.random() * FEMALE_NAMES.length)];
        } else {
            name = MALE_NAMES[(int) (Math.random() * MALE_NAMES.length)];
        }
        String rightSurname = sex == Sex.FEMALE ? surname.endsWith("ий")
                ? surname.substring(0, surname.lastIndexOf("ий")) + "ая"
                : surname + "а" : surname;
        byte age = (byte) ((isAdult ? 18 : 0) + Math.random() * (isAdult ? 42 : 18));
        double income = Math.random() * 1000;
        return new Person(name, rightSurname, age, sex, income);
    }

    public Person(String firstName, String lastName, int age, Sex sex, double income) {
        this.firstName = firstName;
        this.lastName = lastName;
        this.age = age <= 100 ? (byte) age : 0;
        this.sex = sex;
        this.income = this.age < 18 ? 0 : income;
        this.isAlive = true;
        new Thread(this).start();
        log.write("Человек создан: " + this);
    }

    public void setLastName(String lastName) {
        this.lastName = sex == Sex.FEMALE ? lastName.endsWith("ий")
                ? lastName.substring(0, lastName.lastIndexOf("ий")) + "ая"
                : lastName + "а" : lastName;
    }

    @Override
    public void run() {
        while (isAlive && !Thread.currentThread().isInterrupted()) {
            try {
                Thread.sleep(LATENCY);
            } catch (InterruptedException e) {
                Thread.currentThread().interrupt();
            }
            age++;
            if (age >= 18) income += -0.5 + Math.random() * 2;

            if (isDied()) break;
        }

        isAlive = false;
        log.write(this + " умер" + (sex==Sex.MALE ? "." : "ла."));

    }

    private boolean isDied() {
        int minDieAge = 60;
        int maxDieAge = 100;
        return this.age >= minDieAge + Math.random() * (maxDieAge - minDieAge);
    }

    @Override
    public String toString() {
        return firstName + " " + lastName + " (" + sex + ", возраст: " + age + ")";
    }

    @Override
    public int compareTo(Person o) {
        return this.isAlive() && o.isAlive()
                ? this.age - o.age
                : this.isAlive() ? Integer.MAX_VALUE : Integer.MIN_VALUE;
    }

    public enum Sex {
        FEMALE,
        MALE
    }
}
